/****************************************Copyright (c)****************************************************
**               Copyright © 2003~2009 Shenzhen uCdragon Technology Co.,Ltd. All Rights Reserved 
**
**                                 http://www.ucdragon.com
**
**      ÉîÛÚÊÐÓÅÁú¿Æ¼¼ÓÐÏÞ¹«Ë¾ËùÌá¹©µÄËùÓÐ·þÎñÄÚÈÝÖ¼ÔÚÐ­Öú¿Í»§¼ÓËÙ²úÆ·µÄÑÐ·¢½ø¶È£¬ÔÚ·þÎñ¹ý³ÌÖÐËùÌá¹©
**  µÄÈÎºÎ³ÌÐò¡¢ÎÄµµ¡¢²âÊÔ½á¹û¡¢·½°¸¡¢Ö§³ÖµÈ×ÊÁÏºÍÐÅÏ¢£¬¶¼½ö¹©²Î¿¼£¬¿Í»§ÓÐÈ¨²»Ê¹ÓÃ»ò×ÔÐÐ²Î¿¼ÐÞ¸Ä£¬±¾¹«Ë¾²»
**  Ìá¹©ÈÎºÎµÄÍêÕûÐÔ¡¢¿É¿¿ÐÔµÈ±£Ö¤£¬ÈôÔÚ¿Í»§Ê¹ÓÃ¹ý³ÌÖÐÒòÈÎºÎÔ­ÒòÔì³ÉµÄÌØ±ðµÄ¡¢Å¼È»µÄ»ò¼ä½ÓµÄËðÊ§£¬±¾¹«Ë¾²»
**  ³Ðµ£ÈÎºÎÔðÈÎ¡£
**                                                                        ¡ªÉîÛÚÊÐÓÅÁú¿Æ¼¼ÓÐÏÞ¹«Ë¾
**
**--------------File Info---------------------------------------------------------------------------------
** File name:               MKL_spi.c
** Last modified date:     
** Last version:            V1.0
** Descriptions:            spiÏà¹Øº¯Êý
**
** Modified date:      
** Version:            
** Descriptions:       
**
*********************************************************************************************************/
#include "includes.h"


/*********************************************************************************************************
** Function name:           spiInit
** Descriptions:            spi³õÊ¼»¯
** input parameters:        SPIÊäÈë»ùµØÖ· ÊäÈëÖ÷´ÓÄ£Ê½
** output parameters:       none
** Returned value:          none
** Created by:              
** Created date
**--------------------------------------------------------------------------------------------------------
** Modified by:             
** Modified date:           
*********************************************************************************************************/
void spiInit (SPI_MemMapPtr SPI,BOOLEAN bMode)
{
    SIM_SCGC4 |= SIM_SCGC4_SPI0_MASK;                                   /* ¿ªÆôSPI0                     */
                                                                        /* CPOL = 0, SCK ÎªµÍÓÐÐ§       */
                                                                        /* MSTR = 1, SPI ´¦ÓÚÖ÷Ä£Ê½     */
                                                                        /* LSBF = 0, MSB (Î»7)ÔÚÏÈ      */
                                                                        /* SPIE = 0, SPI ÖÐ¶Ï±»½ûÖ¹     */
                                                                        /* CPHA = 0, SCKµÚÒ»¸öÊ±ÖÓÑØ²ÉÑù*/
    SPI->C1 |= SPI_C1_SPE_MASK ;                                        /* SPIÊ¹ÄÜ                      */
    SPI->C1 &= ~(1 << SPI_C1_CPHA_SHIFT);
    if(bMode == Master) {                                               /* Ö÷Ä£Ê½                       */
        SPI->C1 |= SPI_C1_MSTR_MASK;
    } else {                                                            /* ´ÓÄ£Ê½                       */
        SPI->C1 &= ~(1 << SPI_C1_MSTR_SHIFT);
    }
    SPI->BR |= SPI_BR_SPPR(0) ;                                         /* Ê±ÖÓ·ÖÆµ                     */
}

/*********************************************************************************************************
** º¯ÊýÃû³Æ: Send_Byte
** º¯Êý¹¦ÄÜ£ºSPI·¢ËÍÒ»¸ö×Ö½ÚÊý¾Ý SPI0Çý¶¯
** ÊäÈë²ÎÊý: data
** Êä³ö²ÎÊý: ÎÞ
** ·µ »Ø Öµ£ºÎÞ
*********************************************************************************************************/
INT8U Send_Byte (INT8U ucdata)
{
    INT8U ucTemp;
    while((SPI0_S & SPI_S_SPTEF_MASK) != SPI_S_SPTEF_MASK);             /* ·¢ËÍÇ°ÒªÏÈÅÐ¶Ï¼Ä´æÆ÷         */
    SPI0_DL = ucdata;
    
    while((SPI0_S & SPI_S_SPRF_MASK) != SPI_S_SPRF_MASK);               /* ½ÓÊÕÊý¾ÝÓÐÐ§                 */
    ucTemp = SPI0_DL;                                                    /* Çå¿Õ½ÓÊÕ±ê¼Ç¼Ä´æÆ÷           */
    ucTemp = ucTemp;
	return ucTemp;
}

/*********************************************************************************************************
** º¯ÊýÃû³Æ:Get_Byte
** º¯Êý¹¦ÄÜ:SPI½Ó¿Ú½ÓÊÕÒ»¸ö×Ö½ÚÊý¾Ý Ê¹ÓÃSPI0
** ÊäÈë²ÎÊý:ÎÞ
** Êä³ö²ÎÊý:ÎÞ
*********************************************************************************************************/
INT8U Get_Byte (void)
{
    INT8U ucTemp;
    while((SPI0_S & SPI_S_SPTEF_MASK) != SPI_S_SPTEF_MASK);             /* ·¢ËÍÇ°ÒªÏÈÅÐ¶Ï¼Ä´æÆ÷         */
    SPI0_DL = 0xff;                                                      /* ·¢ËÍ¿ÕÊý¾Ý¶ÁÈ¡ÄÚÈÝ           */

    while((SPI0_S & SPI_S_SPRF_MASK) != SPI_S_SPRF_MASK);               /* ½ÓÊÕÊý¾ÝÓÐÐ§                 */
    ucTemp = SPI0_DL;
    return (INT8U)(ucTemp);                                             /* ·µ»Ø½ÓÊÕµ½µÄÊý¾Ý             */
}

/*********************************************************************************************************
** Function name:           spiTX
** Descriptions:            spi³õÊ¼»¯
** input parameters:        SPIÊäÈë»ùµØÖ· ²éÑ¯·½Ê½·¢ËÍÊý¾Ý
** output parameters:       none
** Returned value:          none
** Created by:              JiaoLong Liu
** Created date:            2012-12-12
**--------------------------------------------------------------------------------------------------------
** Modified by:             
** Modified date:           
*********************************************************************************************************/
void spiTX(SPI_MemMapPtr SPI,INT8U ucData)
{
    while((SPI->S & SPI_S_SPTEF_MASK) != SPI_S_SPTEF_MASK);             /* ·¢ËÍÇ°ÒªÏÈÅÐ¶Ï¼Ä´æÆ÷         */
    SPI->DL = ucData;
}

/*********************************************************************************************************
  END FILE 
*********************************************************************************************************/



