/****************************************Copyright (c)****************************************************
**               Copyright © 2003~2009 Shenzhen uCdragon Technology Co.,Ltd. All Rights Reserved 
**
**                                 http://www.ucdragon.cn
**
**      ÉîÛÚÊĞÓÅÁú¿Æ¼¼ÓĞÏŞ¹«Ë¾ËùÌá¹©µÄËùÓĞ·şÎñÄÚÈİÖ¼ÔÚĞ­Öú¿Í»§¼ÓËÙ²úÆ·µÄÑĞ·¢½ø¶È£¬ÔÚ·şÎñ¹ı³ÌÖĞËùÌá¹©
**  µÄÈÎºÎ³ÌĞò¡¢ÎÄµµ¡¢²âÊÔ½á¹û¡¢·½°¸¡¢Ö§³ÖµÈ×ÊÁÏºÍĞÅÏ¢£¬¶¼½ö¹©²Î¿¼£¬¿Í»§ÓĞÈ¨²»Ê¹ÓÃ»ò×ÔĞĞ²Î¿¼ĞŞ¸Ä£¬±¾¹«Ë¾²»
**  Ìá¹©ÈÎºÎµÄÍêÕûĞÔ¡¢¿É¿¿ĞÔµÈ±£Ö¤£¬ÈôÔÚ¿Í»§Ê¹ÓÃ¹ı³ÌÖĞÒòÈÎºÎÔ­ÒòÔì³ÉµÄÌØ±ğµÄ¡¢Å¼È»µÄ»ò¼ä½ÓµÄËğÊ§£¬±¾¹«Ë¾²»
**  ³Ğµ£ÈÎºÎÔğÈÎ¡£
**                                                                        ¡ªÉîÛÚÊĞÓÅÁú¿Æ¼¼ÓĞÏŞ¹«Ë¾
**
**--------------File Info---------------------------------------------------------------------------------
** File name:               MKL_adc.c
** Last version:            V1.0
** Descriptions:            dacÇı¶¯³ÌĞò
**
** Modified by:        
** Modified date:      
** Version:            
** Descriptions:       
**
*********************************************************************************************************/
#include "..\..\App\includes.h"

/*********************************************************************************************************
** Function name:           adcInit
** Descriptions:            adcµÄ³õÊ¼»¯
** input parameters:        none
** output parameters:       none
** Returned value:          none
** Created by:              
** Created date
**--------------------------------------------------------------------------------------------------------
** Modified by:             
** Modified date:           
*********************************************************************************************************/
void dacInit(void) 
{
    SIM_SCGC5 |= SIM_SCGC5_PORTE_MASK;                                  /* ¿ªÆôPE GPIOÊ±ÖÓ              */
    PORTE_PCR30 |= PORT_PCR_MUX(0);                                     /* ¿ªÆôPE30¹Ü½ÅÄ£Äâ¹¦ÄÜ         */
    SIM_SCGC6 |= SIM_SCGC6_DAC0_MASK;                                   /* ¿ªÆôDACÊ±ÖÓ                  */
    /*
     * ÅäÖÃDACÏà¹Ø¹¦ÄÜ
     */
    DAC0_C0 |= DAC_C0_DACEN_MASK | DAC_C0_DACRFS_MASK | DAC_C0_LPEN_MASK | DAC_C0_DACTRGSEL_MASK;
}

/*********************************************************************************************************
** Function name:           dacTrigger
** Descriptions:            dacÊä³ö
** input parameters:        none
** output parameters:       none
** Returned value:          none
** Created by:              JiaoLong Liu
** Created date:            2012-12-12
**--------------------------------------------------------------------------------------------------------
** Modified by:             
** Modified date:           
*********************************************************************************************************/


/*********************************************************************************************************
  END FILE 
*********************************************************************************************************/



