/****************************************Copyright (c)****************************************************
**               Copyright © 2003~2009 Shenzhen uCdragon Technology Co.,Ltd. All Rights Reserved 
**
**                                 http://www.ucdragon.cn
**
**      ÉîÛÚÊĞÓÅÁú¿Æ¼¼ÓĞÏŞ¹«Ë¾ËùÌá¹©µÄËùÓĞ·şÎñÄÚÈİÖ¼ÔÚĞ­Öú¿Í»§¼ÓËÙ²úÆ·µÄÑĞ·¢½ø¶È£¬ÔÚ·şÎñ¹ı³ÌÖĞËùÌá¹©
**  µÄÈÎºÎ³ÌĞò¡¢ÎÄµµ¡¢²âÊÔ½á¹û¡¢·½°¸¡¢Ö§³ÖµÈ×ÊÁÏºÍĞÅÏ¢£¬¶¼½ö¹©²Î¿¼£¬¿Í»§ÓĞÈ¨²»Ê¹ÓÃ»ò×ÔĞĞ²Î¿¼ĞŞ¸Ä£¬±¾¹«Ë¾²»
**  Ìá¹©ÈÎºÎµÄÍêÕûĞÔ¡¢¿É¿¿ĞÔµÈ±£Ö¤£¬ÈôÔÚ¿Í»§Ê¹ÓÃ¹ı³ÌÖĞÒòÈÎºÎÔ­ÒòÔì³ÉµÄÌØ±ğµÄ¡¢Å¼È»µÄ»ò¼ä½ÓµÄËğÊ§£¬±¾¹«Ë¾²»
**  ³Ğµ£ÈÎºÎÔğÈÎ¡£
**                                                                        ¡ªÉîÛÚÊĞÓÅÁú¿Æ¼¼ÓĞÏŞ¹«Ë¾
**
**--------------File Info---------------------------------------------------------------------------------
** File name:               MKL_pit.c
** Last modified date:     
** Last version:            V1.0
** Descriptions:            pitÇı¶¯³ÌĞò
**
**----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
** Modified by:        
** Modified date:      
** Version:            
** Descriptions:       
**
*********************************************************************************************************/
#include "..\..\App\includes.h"

/*********************************************************************************************************
** Function name:           pitInit
** Descriptions:            pitµÄ³õÊ¼»¯ 1sÖĞ¶ÏÖÜÆÚ
** input parameters:        none
** output parameters:       none
** Returned value:          none
** Created by:              
** Created date:           
**--------------------------------------------------------------------------------------------------------
** Modified by:             
** Modified date:           
*********************************************************************************************************/
void pitInit(void) 
{
    SIM_SCGC6 |= SIM_SCGC6_PIT_MASK;                                    /* Ê±ÖÓÅäÖÃ                     */
    PIT_MCR &= ~(1 << PIT_MCR_MDIS_SHIFT);                              /* Ê¹ÄÜÊ±ÖÓ                     */
    PIT_LDVAL0 = 1200;                     //20K                        /* Ê±ÖÓ0³õÊ¼Öµ                  */
//  PIT_TFLG0 |= PIT_TFLG_TIF_MASK;                                     /* ±êÖ¾Î»Çå¿Õ                   */
//  PIT_TCTRL0 |= PIT_TCTRL_TIE_MASK | PIT_TCTRL_TEN_MASK;              /* ¿ªÆôÖĞ¶Ï,Ê¹ÄÜ¶¨Ê±Æ÷          */
	PIT_TCTRL0 |=  PIT_TCTRL_TEN_MASK;                                  //Ê¹ÄÜ¶¨Ê±Æ÷£¬²¢²»Ê¹ÄÜÖĞ¶Ï
}

/*********************************************************************************************************
  END FILE 
*********************************************************************************************************/



