#ifndef __ZMD_ADC_MKL_H
#define __ZMD_ADC_MKL_H
#include "includes.h"
//
//-------- <<< Use Configuration Wizard in Context Menu >>> ----------------------------------------------
//
#ifdef __cplusplus
extern "C" {
#endif
/*********************************************************************************************************
  宏定义
*********************************************************************************************************/

/*********************************************************************************************************
  函数声明 
*********************************************************************************************************/  
extern void adcInit(void) ;
extern uint16_t adcGetUint(void);
extern uint16_t adcGetPT1000(void);
extern uint16_t adcGetBattery(void);
extern uint16_t adcGetExterlPowerUint (void);
extern void lptmrInit(void);  
extern unsigned char ADC0_Calibration(void);
	

#ifdef __cplusplus
}
#endif


#endif


/*********************************************************************************************************
  END FILE 
*********************************************************************************************************/  


